backend/app/controllers/users/registrations_controller.rb

INSERT INTO "users" ("name", "lastname", "email", "password", "icon", "type", "created_at", "updated_at", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "jti") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
INSERT INTO "users" ("name", "lastname", "email", "password", "icon", "user_type", "created_at", "updated_at", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "jti") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
UPDATE "users" SET "updated_at" = $1 WHERE "users"."id" = $2  [["updated_at", "2023-11-22 16:02:52.307238"], ["id", 13]]
---
  def create
    build_resource(sign_up_params)

    resource.icon.attach(params[:user][:icon]) if params[:user][:icon].present?

    if resource.save