backend/app/controllers/users/sessions_controller.rb

  def create
    user = User.find_by(email: params[:user][:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "admin@gmail.com"], ["LIMIT", 1]]